#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RunningBlood_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "VertexPaintDetectionPlugin_structs.hpp"


namespace SDK::Params
{

// Function RunningBlood_BP.RunningBlood_BP_C.ExecuteUbergraph_RunningBlood_BP
// 0x0D60 (0x0D60 - 0x0000)
struct RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition; // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal;  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue; // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRVPDPApplyColorsUsingVertexChannelSettings K2Node_MakeStruct_RVPDPApplyColorsUsingVertexChannelSettings; // 0x00C8(0x00A8)(ContainsInstancedReference)
	struct FRVPDPAtLocationTasksSettings          K2Node_MakeStruct_RVPDPAtLocationTasksSettings;    // 0x0170(0x0060)()
	struct FRVPDPApplyColorSettings               K2Node_MakeStruct_RVPDPApplyColorSettings;         // 0x01D0(0x02D0)(ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x04F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F5[0x3];                                      // 0x04F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FD[0x3];                                      // 0x04FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0500(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A[0x6];                                      // 0x050A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0568(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0580(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition_1; // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal_1; // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName_1; // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance_1; // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue_1; // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6[0x2];                                      // 0x05C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x05C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x05E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody_1; // 0x0600(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue_1; // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C[0x4];                                      // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0662(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0663(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0664(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_665[0x3];                                      // 0x0665(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x0668(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0680(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_AddComponent_ReturnValue;                 // 0x06E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F1[0x3];                                      // 0x06F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_5;    // 0x0700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_2;            // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72A[0x6];                                      // 0x072A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x073C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73D[0x3];                                      // 0x073D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0744(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x074C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74D[0x3];                                      // 0x074D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_754[0x4];                                      // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x0758(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_762[0x6];                                      // 0x0762(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0778(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWillie_BP_C*                           K2Node_DynamicCast_AsWillie_BP;                    // 0x0780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_2;           // 0x0789(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRVPDPMultiThreadSettings              K2Node_MakeStruct_RVPDPMultiThreadSettings;        // 0x078A(0x0001)(NoDestructor)
	uint8                                         Pad_78B[0x1];                                      // 0x078B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x07A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A2[0x2];                                      // 0x07A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRVPDPPaintAtLocationAreaOfEffectSettings K2Node_MakeStruct_RVPDPPaintAtLocationAreaOfEffectSettings; // 0x07C0(0x0048)()
	struct FRVPDPPaintAtLocationSettings          K2Node_MakeStruct_RVPDPPaintAtLocationSettings;    // 0x0808(0x0548)(ContainsInstancedReference)
	float                                         K2Node_MakeStruct_AreaOfEffectRangeEnd_ImplicitCast; // 0x0D50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP) == 0x000010, "Wrong alignment on RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP");
static_assert(sizeof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP) == 0x000D60, "Wrong size on RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, EntryPoint) == 0x000000, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition) == 0x000068, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal) == 0x000080, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName) == 0x000098, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance) == 0x0000A0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue) == 0x0000A4, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Less_IntInt_ReturnValue) == 0x0000A5, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Length_ReturnValue_2) == 0x0000AC, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000B0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPApplyColorsUsingVertexChannelSettings) == 0x0000C8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPApplyColorsUsingVertexChannelSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPAtLocationTasksSettings) == 0x000170, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPAtLocationTasksSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPApplyColorSettings) == 0x0001D0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPApplyColorSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0004A0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0004B8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Greater_IntInt_ReturnValue) == 0x0004D0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0004D8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Length_ReturnValue_3) == 0x0004F0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0004F4, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Array_Index_Variable) == 0x0004F8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0004FC, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Get_Item) == 0x000500, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue) == 0x000508, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_RemoveItem_ReturnValue) == 0x000509, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000510, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x000528, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x000540, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_1) == 0x000544, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000548, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Array_Index_Variable_1) == 0x000560, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000568, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Get_Item_1) == 0x000580, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition_1) == 0x000588, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal_1) == 0x0005A0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName_1) == 0x0005B8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance_1) == 0x0005C0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue_1) == 0x0005C4, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_2) == 0x0005C5, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0005C8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x0005E0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0005E8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetClosestPointOnCollision_OutPointOnBody_1) == 0x000600, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetClosestPointOnCollision_OutPointOnBody_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetClosestPointOnCollision_ReturnValue_1) == 0x000618, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetClosestPointOnCollision_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000620, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x000638, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Vector_Distance_ReturnValue) == 0x000650, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Dot_VectorVector_ReturnValue) == 0x000658, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000660, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000661, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_BooleanAND_ReturnValue) == 0x000662, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_bool_True_if_break_was_hit_Variable) == 0x000663, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000664, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x000668, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000680, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_AddComponent_ReturnValue) == 0x0006E0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Vector_Distance_ReturnValue_1) == 0x0006E8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0006F0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_AddUnique_ReturnValue) == 0x0006F4, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0006F8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue_5) == 0x000700, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Vector_Distance_ReturnValue_2) == 0x000718, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Vector_Distance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000720, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Variable) == 0x000724, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_3) == 0x000728, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_4) == 0x000729, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000730, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Loop_Counter_Variable_1) == 0x000738, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x00073C, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000740, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_BooleanAND_ReturnValue_1) == 0x000744, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Subtract_IntInt_ReturnValue) == 0x000748, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_5) == 0x00074C, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Array_Index_Variable_2) == 0x000750, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Get_Item_2) == 0x000758, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_6) == 0x000760, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Contains_ReturnValue) == 0x000761, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetOwner_ReturnValue) == 0x000768, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_7) == 0x000770, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetOwner_ReturnValue_1) == 0x000778, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_DynamicCast_AsWillie_BP) == 0x000780, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_DynamicCast_AsWillie_BP' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_DynamicCast_bSuccess) == 0x000788, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_RemoveItem_ReturnValue_2) == 0x000789, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_RemoveItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPMultiThreadSettings) == 0x00078A, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPMultiThreadSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Loop_Counter_Variable_2) == 0x00078C, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetGameInstance_ReturnValue) == 0x000790, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_DynamicCast_AsGI_Settings) == 0x000798, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_DynamicCast_bSuccess_1) == 0x0007A0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x0007A1, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x0007A4, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x0007A8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0007B0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0007B8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPPaintAtLocationAreaOfEffectSettings) == 0x0007C0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPPaintAtLocationAreaOfEffectSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPPaintAtLocationSettings) == 0x000808, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPPaintAtLocationSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_AreaOfEffectRangeEnd_ImplicitCast) == 0x000D50, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_AreaOfEffectRangeEnd_ImplicitCast' has a wrong offset!");

// Function RunningBlood_BP.RunningBlood_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct RunningBlood_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RunningBlood_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on RunningBlood_BP_C_ReceiveTick");
static_assert(sizeof(RunningBlood_BP_C_ReceiveTick) == 0x000004, "Wrong size on RunningBlood_BP_C_ReceiveTick");
static_assert(offsetof(RunningBlood_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'RunningBlood_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function RunningBlood_BP.RunningBlood_BP_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct RunningBlood_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RunningBlood_BP_C_UserConstructionScript) == 0x000001, "Wrong alignment on RunningBlood_BP_C_UserConstructionScript");
static_assert(sizeof(RunningBlood_BP_C_UserConstructionScript) == 0x000001, "Wrong size on RunningBlood_BP_C_UserConstructionScript");
static_assert(offsetof(RunningBlood_BP_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'RunningBlood_BP_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

