#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_PlayerProgression

#include "Basic.hpp"

#include "Str_Loadout_Equipment_structs.hpp"
#include "Gauntlet_Progress_Struct_structs.hpp"


namespace SDK::Params
{

// Function SG_PlayerProgression.SG_PlayerProgression_C.ExecuteUbergraph_SG_PlayerProgression
// 0x2C368 (0x2C368 - 0x0000)
struct SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct;        // 0x0008(0x4DA0)(HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x4DA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA9[0x7];                                     // 0x4DA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_1;      // 0x4DB0(0x4DA0)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x9B50(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x9B60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B61[0x7];                                     // 0x9B61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_Loadout_Equipment                 K2Node_CustomEvent_Saved_Equipment_Struct;         // 0x9B68(0x08A0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_2;      // 0xA408(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_3;      // 0xF1A8(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_4;      // 0x13F48(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_5;      // 0x18CE8(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_6;      // 0x1DA88(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_7;      // 0x22828(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_8;      // 0x275C8(0x4DA0)(HasGetValueTypeHash)
};
static_assert(alignof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression) == 0x000008, "Wrong alignment on SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression");
static_assert(sizeof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression) == 0x02C368, "Wrong size on SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, EntryPoint) == 0x000000, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::EntryPoint' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_MakeStruct_Gauntlet_Progress_Struct) == 0x000008, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_MakeStruct_Gauntlet_Progress_Struct' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, CallFunc_SaveGameToSlot_ReturnValue) == 0x004DA8, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_MakeStruct_Gauntlet_Progress_Struct_1) == 0x004DB0, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_MakeStruct_Gauntlet_Progress_Struct_1' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, CallFunc_Conv_IntToString_ReturnValue) == 0x009B50, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_SwitchInteger_CmpSuccess) == 0x009B60, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_CustomEvent_Saved_Equipment_Struct) == 0x009B68, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_CustomEvent_Saved_Equipment_Struct' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_MakeStruct_Gauntlet_Progress_Struct_2) == 0x00A408, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_MakeStruct_Gauntlet_Progress_Struct_2' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_MakeStruct_Gauntlet_Progress_Struct_3) == 0x00F1A8, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_MakeStruct_Gauntlet_Progress_Struct_3' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_MakeStruct_Gauntlet_Progress_Struct_4) == 0x013F48, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_MakeStruct_Gauntlet_Progress_Struct_4' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_MakeStruct_Gauntlet_Progress_Struct_5) == 0x018CE8, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_MakeStruct_Gauntlet_Progress_Struct_5' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_MakeStruct_Gauntlet_Progress_Struct_6) == 0x01DA88, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_MakeStruct_Gauntlet_Progress_Struct_6' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_MakeStruct_Gauntlet_Progress_Struct_7) == 0x022828, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_MakeStruct_Gauntlet_Progress_Struct_7' has a wrong offset!");
static_assert(offsetof(SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression, K2Node_MakeStruct_Gauntlet_Progress_Struct_8) == 0x0275C8, "Member 'SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression::K2Node_MakeStruct_Gauntlet_Progress_Struct_8' has a wrong offset!");

// Function SG_PlayerProgression.SG_PlayerProgression_C.Save Rank Equipment Event
// 0x08A0 (0x08A0 - 0x0000)
struct SG_PlayerProgression_C_Save_Rank_Equipment_Event final
{
public:
	struct FStr_Loadout_Equipment                 Saved_Equipment_Struct;                            // 0x0000(0x08A0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SG_PlayerProgression_C_Save_Rank_Equipment_Event) == 0x000008, "Wrong alignment on SG_PlayerProgression_C_Save_Rank_Equipment_Event");
static_assert(sizeof(SG_PlayerProgression_C_Save_Rank_Equipment_Event) == 0x0008A0, "Wrong size on SG_PlayerProgression_C_Save_Rank_Equipment_Event");
static_assert(offsetof(SG_PlayerProgression_C_Save_Rank_Equipment_Event, Saved_Equipment_Struct) == 0x000000, "Member 'SG_PlayerProgression_C_Save_Rank_Equipment_Event::Saved_Equipment_Struct' has a wrong offset!");

}

