#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shield_Pavise_Tower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModularWeaponBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Shield_Pavise_Tower.Shield_Pavise_Tower_C
// 0x0020 (0x0B68 - 0x0B48)
class AShield_Pavise_Tower_C final : public AModularWeaponBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Shield_Pavise_Tower_C;              // 0x0B48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Base1_0;                                           // 0x0B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1;                                              // 0x0B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pavise_Tower;                                      // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_Shield_Pavise_Tower(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shield_Pavise_Tower_C">();
	}
	static class AShield_Pavise_Tower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AShield_Pavise_Tower_C>();
	}
};
static_assert(alignof(AShield_Pavise_Tower_C) == 0x000008, "Wrong alignment on AShield_Pavise_Tower_C");
static_assert(sizeof(AShield_Pavise_Tower_C) == 0x000B68, "Wrong size on AShield_Pavise_Tower_C");
static_assert(offsetof(AShield_Pavise_Tower_C, UberGraphFrame_Shield_Pavise_Tower_C) == 0x000B48, "Member 'AShield_Pavise_Tower_C::UberGraphFrame_Shield_Pavise_Tower_C' has a wrong offset!");
static_assert(offsetof(AShield_Pavise_Tower_C, Base1_0) == 0x000B50, "Member 'AShield_Pavise_Tower_C::Base1_0' has a wrong offset!");
static_assert(offsetof(AShield_Pavise_Tower_C, Tip1) == 0x000B58, "Member 'AShield_Pavise_Tower_C::Tip1' has a wrong offset!");
static_assert(offsetof(AShield_Pavise_Tower_C, Pavise_Tower) == 0x000B60, "Member 'AShield_Pavise_Tower_C::Pavise_Tower' has a wrong offset!");

}

