#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Card_Boss

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Card_Boss.UI_Card_Boss_C.ExecuteUbergraph_UI_Card_Boss
// 0x00E8 (0x00E8 - 0x0000)
struct UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HalfSwordGameMode_C*                K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_2;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss) == 0x000008, "Wrong alignment on UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss");
static_assert(sizeof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss) == 0x0000E8, "Wrong size on UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, EntryPoint) == 0x000000, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_SetGamePaused_ReturnValue) == 0x000010, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_GetGameMode_ReturnValue) == 0x000018, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode) == 0x000020, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, K2Node_Event_MyGeometry) == 0x000038, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, K2Node_Event_InDeltaTime) == 0x000070, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, K2Node_Event_IsDesignTime) == 0x000074, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_PlayAnimation_ReturnValue_1) == 0x000078, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_PlayAnimation_ReturnValue_2) == 0x000080, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_SetGamePaused_ReturnValue_1) == 0x000088, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_GetPlayerController_ReturnValue_1) == 0x000090, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_GetGameMode_ReturnValue_1) == 0x000098, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_Not_PreBool_ReturnValue) == 0x0000A0, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_GetGameInstance_ReturnValue) == 0x0000A8, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, K2Node_DynamicCast_AsGI_Settings) == 0x0000B0, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000C0, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000C8, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_GetGameMode_ReturnValue_2) == 0x0000D0, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_GetGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_SetGamePaused_ReturnValue_2) == 0x0000D8, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_SetGamePaused_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000E0, "Member 'UI_Card_Boss_C_ExecuteUbergraph_UI_Card_Boss::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");

// Function UI_Card_Boss.UI_Card_Boss_C.GetPercent
// 0x0030 (0x0030 - 0x0000)
struct UI_Card_Boss_C_GetPercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Card_Boss_C_GetPercent) == 0x000008, "Wrong alignment on UI_Card_Boss_C_GetPercent");
static_assert(sizeof(UI_Card_Boss_C_GetPercent) == 0x000030, "Wrong size on UI_Card_Boss_C_GetPercent");
static_assert(offsetof(UI_Card_Boss_C_GetPercent, ReturnValue) == 0x000000, "Member 'UI_Card_Boss_C_GetPercent::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetPercent, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'UI_Card_Boss_C_GetPercent::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetPercent, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UI_Card_Boss_C_GetPercent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetPercent, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000018, "Member 'UI_Card_Boss_C_GetPercent::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetPercent, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'UI_Card_Boss_C_GetPercent::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetPercent, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000028, "Member 'UI_Card_Boss_C_GetPercent::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_Card_Boss.UI_Card_Boss_C.GetText
// 0x0060 (0x0060 - 0x0000)
struct UI_Card_Boss_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0050(0x0010)()
};
static_assert(alignof(UI_Card_Boss_C_GetText) == 0x000008, "Wrong alignment on UI_Card_Boss_C_GetText");
static_assert(sizeof(UI_Card_Boss_C_GetText) == 0x000060, "Wrong size on UI_Card_Boss_C_GetText");
static_assert(offsetof(UI_Card_Boss_C_GetText, ReturnValue) == 0x000000, "Member 'UI_Card_Boss_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'UI_Card_Boss_C_GetText::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'UI_Card_Boss_C_GetText::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'UI_Card_Boss_C_GetText::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'UI_Card_Boss_C_GetText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'UI_Card_Boss_C_GetText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'UI_Card_Boss_C_GetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText, CallFunc_SelectText_ReturnValue) == 0x000050, "Member 'UI_Card_Boss_C_GetText::CallFunc_SelectText_ReturnValue' has a wrong offset!");

// Function UI_Card_Boss.UI_Card_Boss_C.GetText_0
// 0x0078 (0x0078 - 0x0000)
struct UI_Card_Boss_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0010)()
};
static_assert(alignof(UI_Card_Boss_C_GetText_0) == 0x000008, "Wrong alignment on UI_Card_Boss_C_GetText_0");
static_assert(sizeof(UI_Card_Boss_C_GetText_0) == 0x000078, "Wrong size on UI_Card_Boss_C_GetText_0");
static_assert(offsetof(UI_Card_Boss_C_GetText_0, ReturnValue) == 0x000000, "Member 'UI_Card_Boss_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText_0, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'UI_Card_Boss_C_GetText_0::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText_0, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UI_Card_Boss_C_GetText_0::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText_0, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'UI_Card_Boss_C_GetText_0::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText_0, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000038, "Member 'UI_Card_Boss_C_GetText_0::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText_0, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'UI_Card_Boss_C_GetText_0::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText_0, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000058, "Member 'UI_Card_Boss_C_GetText_0::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetText_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'UI_Card_Boss_C_GetText_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UI_Card_Boss.UI_Card_Boss_C.GetVisibility_0
// 0x0005 (0x0005 - 0x0000)
struct UI_Card_Boss_C_GetVisibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Card_Boss_C_GetVisibility_0) == 0x000001, "Wrong alignment on UI_Card_Boss_C_GetVisibility_0");
static_assert(sizeof(UI_Card_Boss_C_GetVisibility_0) == 0x000005, "Wrong size on UI_Card_Boss_C_GetVisibility_0");
static_assert(offsetof(UI_Card_Boss_C_GetVisibility_0, ReturnValue) == 0x000000, "Member 'UI_Card_Boss_C_GetVisibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetVisibility_0, Temp_bool_Variable) == 0x000001, "Member 'UI_Card_Boss_C_GetVisibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetVisibility_0, Temp_byte_Variable) == 0x000002, "Member 'UI_Card_Boss_C_GetVisibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetVisibility_0, Temp_byte_Variable_1) == 0x000003, "Member 'UI_Card_Boss_C_GetVisibility_0::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_GetVisibility_0, K2Node_Select_Default) == 0x000004, "Member 'UI_Card_Boss_C_GetVisibility_0::K2Node_Select_Default' has a wrong offset!");

// Function UI_Card_Boss.UI_Card_Boss_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Card_Boss_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Card_Boss_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Card_Boss_C_PreConstruct");
static_assert(sizeof(UI_Card_Boss_C_PreConstruct) == 0x000001, "Wrong size on UI_Card_Boss_C_PreConstruct");
static_assert(offsetof(UI_Card_Boss_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Card_Boss_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Card_Boss.UI_Card_Boss_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Card_Boss_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Card_Boss_C_Tick) == 0x000004, "Wrong alignment on UI_Card_Boss_C_Tick");
static_assert(sizeof(UI_Card_Boss_C_Tick) == 0x00003C, "Wrong size on UI_Card_Boss_C_Tick");
static_assert(offsetof(UI_Card_Boss_C_Tick, MyGeometry) == 0x000000, "Member 'UI_Card_Boss_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Card_Boss_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_Card_Boss_C_Tick::InDeltaTime' has a wrong offset!");

}

