#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_FadeToLife

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_FadeToLife.UI_FadeToLife_C
// 0x0018 (0x02F8 - 0x02E0)
class UUI_FadeToLife_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeToWhite;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 White;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_FadeToLife(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_FadeToLife_C">();
	}
	static class UUI_FadeToLife_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_FadeToLife_C>();
	}
};
static_assert(alignof(UUI_FadeToLife_C) == 0x000008, "Wrong alignment on UUI_FadeToLife_C");
static_assert(sizeof(UUI_FadeToLife_C) == 0x0002F8, "Wrong size on UUI_FadeToLife_C");
static_assert(offsetof(UUI_FadeToLife_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_FadeToLife_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_FadeToLife_C, FadeToWhite) == 0x0002E8, "Member 'UUI_FadeToLife_C::FadeToWhite' has a wrong offset!");
static_assert(offsetof(UUI_FadeToLife_C, White) == 0x0002F0, "Member 'UUI_FadeToLife_C::White' has a wrong offset!");

}

