#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_FadeToAbyss

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_FadeToAbyss.UI_FadeToAbyss_C
// 0x0028 (0x0308 - 0x02E0)
class UUI_FadeToAbyss_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeToBlack;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Last_Chance;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HalfSwordGameMode_C*                BP_Half_Sword_Game_Mode;                           // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_FadeToAbyss(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_FadeToAbyss_C">();
	}
	static class UUI_FadeToAbyss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_FadeToAbyss_C>();
	}
};
static_assert(alignof(UUI_FadeToAbyss_C) == 0x000008, "Wrong alignment on UUI_FadeToAbyss_C");
static_assert(sizeof(UUI_FadeToAbyss_C) == 0x000308, "Wrong size on UUI_FadeToAbyss_C");
static_assert(offsetof(UUI_FadeToAbyss_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_FadeToAbyss_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_FadeToAbyss_C, FadeToBlack) == 0x0002E8, "Member 'UUI_FadeToAbyss_C::FadeToBlack' has a wrong offset!");
static_assert(offsetof(UUI_FadeToAbyss_C, Black) == 0x0002F0, "Member 'UUI_FadeToAbyss_C::Black' has a wrong offset!");
static_assert(offsetof(UUI_FadeToAbyss_C, Last_Chance) == 0x0002F8, "Member 'UUI_FadeToAbyss_C::Last_Chance' has a wrong offset!");
static_assert(offsetof(UUI_FadeToAbyss_C, BP_Half_Sword_Game_Mode) == 0x000300, "Member 'UUI_FadeToAbyss_C::BP_Half_Sword_Game_Mode' has a wrong offset!");

}

