#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_FadeToAbyss

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_FadeToAbyss.UI_FadeToAbyss_C.ExecuteUbergraph_UI_FadeToAbyss
// 0x0070 (0x0070 - 0x0000)
struct UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCursor_BP_C*                           CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HalfSwordGameMode_C*                K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss) == 0x000008, "Wrong alignment on UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss");
static_assert(sizeof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss) == 0x000070, "Wrong size on UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, EntryPoint) == 0x000000, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_Create_ReturnValue) == 0x000018, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_GetGameMode_ReturnValue) == 0x000028, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode) == 0x000030, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_GetGameMode_ReturnValue_1) == 0x000048, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_BooleanAND_ReturnValue_1) == 0x000050, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_GetGameInstance_ReturnValue) == 0x000058, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, K2Node_DynamicCast_AsGI_Settings) == 0x000060, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000069, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_BooleanAND_ReturnValue_2) == 0x00006A, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss, CallFunc_BooleanAND_ReturnValue_3) == 0x00006B, "Member 'UI_FadeToAbyss_C_ExecuteUbergraph_UI_FadeToAbyss::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

}

