#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Helper_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass UI_Helper_BP.UI_Helper_BP_C
// 0x0060 (0x02F0 - 0x0290)
class AUI_Helper_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Target_Scene;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsHandleComponent*                Handle;                                            // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Handled_Component;                                 // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Grab_Location;                                     // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Grab_Bone;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Target;                                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_MainMenuSNF_C*                      Parent_UI;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Add_Handle_Event(class UPrimitiveComponent* Component, class FName InBoneName, const struct FVector& GrabLocation, class USceneComponent* Target_0);
	void Destroy_Handle_Event();
	void ExecuteUbergraph_UI_Helper_BP(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Helper_BP_C">();
	}
	static class AUI_Helper_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUI_Helper_BP_C>();
	}
};
static_assert(alignof(AUI_Helper_BP_C) == 0x000008, "Wrong alignment on AUI_Helper_BP_C");
static_assert(sizeof(AUI_Helper_BP_C) == 0x0002F0, "Wrong size on AUI_Helper_BP_C");
static_assert(offsetof(AUI_Helper_BP_C, UberGraphFrame) == 0x000290, "Member 'AUI_Helper_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AUI_Helper_BP_C, Target_Scene) == 0x000298, "Member 'AUI_Helper_BP_C::Target_Scene' has a wrong offset!");
static_assert(offsetof(AUI_Helper_BP_C, Scene) == 0x0002A0, "Member 'AUI_Helper_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(AUI_Helper_BP_C, DefaultSceneRoot) == 0x0002A8, "Member 'AUI_Helper_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AUI_Helper_BP_C, Handle) == 0x0002B0, "Member 'AUI_Helper_BP_C::Handle' has a wrong offset!");
static_assert(offsetof(AUI_Helper_BP_C, Handled_Component) == 0x0002B8, "Member 'AUI_Helper_BP_C::Handled_Component' has a wrong offset!");
static_assert(offsetof(AUI_Helper_BP_C, Grab_Location) == 0x0002C0, "Member 'AUI_Helper_BP_C::Grab_Location' has a wrong offset!");
static_assert(offsetof(AUI_Helper_BP_C, Grab_Bone) == 0x0002D8, "Member 'AUI_Helper_BP_C::Grab_Bone' has a wrong offset!");
static_assert(offsetof(AUI_Helper_BP_C, Target) == 0x0002E0, "Member 'AUI_Helper_BP_C::Target' has a wrong offset!");
static_assert(offsetof(AUI_Helper_BP_C, Parent_UI) == 0x0002E8, "Member 'AUI_Helper_BP_C::Parent_UI' has a wrong offset!");

}

