#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HUD

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_HUD.UI_HUD_C.ExecuteUbergraph_UI_HUD
// 0x0390 (0x0390 - 0x0000)
struct UI_HUD_C_ExecuteUbergraph_UI_HUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_WinScreen_C*                        CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0044(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWillie_BP_C*                           K2Node_DynamicCast_AsWillie_BP;                    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_3;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_4;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_5;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_6;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_7;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_8;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue_9;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_10;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HalfSwordGameMode_C*                K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode;      // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue;                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_1;               // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x01FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_2;               // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x0236(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_237[0x1];                                      // 0x0237(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_3;               // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_4;               // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_2;          // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_3;          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_5;               // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_6;               // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_4;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_5;          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_9;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_10;     // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_11;     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_12;     // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_7;               // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_8;               // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_6;          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_7;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_13;     // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_14;     // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_15;     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_16;     // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_9;               // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_10;              // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_14;               // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_15;               // 0x030B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_8;          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_9;          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_17;     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_18;     // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_19;     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_20;     // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_11;              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_16;               // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_10;         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_21;     // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_17;               // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x035B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_18;               // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_1;      // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_2;      // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_3;      // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_4;      // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_5;      // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_6;      // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_7;      // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_8;      // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_9;      // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_10;     // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_11;     // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HUD_C_ExecuteUbergraph_UI_HUD) == 0x000008, "Wrong alignment on UI_HUD_C_ExecuteUbergraph_UI_HUD");
static_assert(sizeof(UI_HUD_C_ExecuteUbergraph_UI_HUD) == 0x000390, "Wrong size on UI_HUD_C_ExecuteUbergraph_UI_HUD");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, EntryPoint) == 0x000000, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_bool_Variable) == 0x000028, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable) == 0x00002A, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_1) == 0x00002B, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_bool_Variable_1) == 0x00002C, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_2) == 0x00002D, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_3) == 0x00002E, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_bool_Variable_2) == 0x00002F, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_4) == 0x000030, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_5) == 0x000031, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_bool_Variable_3) == 0x000032, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_6) == 0x000033, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_7) == 0x000034, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Create_ReturnValue) == 0x000038, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Event_IsDesignTime) == 0x000040, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Event_MyGeometry) == 0x000044, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Event_InDeltaTime) == 0x00007C, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000080, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_AsWillie_BP) == 0x000088, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_AsWillie_BP' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000098, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000B0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BreakVector_X) == 0x0000D0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BreakVector_Y) == 0x0000D8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BreakVector_Z) == 0x0000E0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MakeVector2D_ReturnValue) == 0x0000F0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue) == 0x000100, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000108, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_FClamp_ReturnValue) == 0x000110, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000118, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000120, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000128, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_3) == 0x000130, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_4) == 0x000138, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_5) == 0x000140, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_6) == 0x000148, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_7) == 0x000150, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_8) == 0x000158, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GetGameInstance_ReturnValue) == 0x000160, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_AsGI_Settings) == 0x000168, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_PlayAnimation_ReturnValue) == 0x000178, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_PlayAnimation_ReturnValue_1) == 0x000180, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000188, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_bool_Has_Been_Initd_Variable) == 0x000190, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_bool_IsClosed_Variable) == 0x000191, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_9) == 0x000198, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_10) == 0x0001A0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0001A8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0001A9, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GetGameMode_ReturnValue) == 0x0001B0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode) == 0x0001B8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_bSuccess_2) == 0x0001C0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001C1, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001C2, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue) == 0x0001C3, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_1) == 0x0001C4, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0001C8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0001D0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0001D8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_SelectFloat_ReturnValue) == 0x0001E0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue) == 0x0001E8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_FClamp_ReturnValue_1) == 0x0001F0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001F8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_2) == 0x0001F9, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Select_Default) == 0x0001FA, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_4) == 0x0001FB, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_3) == 0x0001FC, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_1) == 0x0001FD, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_4) == 0x0001FE, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_5) == 0x0001FF, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_5) == 0x000200, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000208, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_6) == 0x000210, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000218, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_7) == 0x000220, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000228, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Select_Default_1) == 0x000230, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_6) == 0x000231, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_8) == 0x000232, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_2) == 0x000233, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_9) == 0x000234, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_7) == 0x000235, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_10) == 0x000236, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_1) == 0x000238, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_11) == 0x000240, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000248, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_12) == 0x000250, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000258, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_13) == 0x000260, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_3) == 0x000261, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_4) == 0x000262, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_8) == 0x000263, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_9) == 0x000264, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_2) == 0x000268, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_3) == 0x000270, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000278, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000280, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000288, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_8) == 0x000290, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_5) == 0x000298, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_6) == 0x000299, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_10) == 0x00029A, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_11) == 0x00029B, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_4) == 0x0002A0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_5) == 0x0002A8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_9) == 0x0002B0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_10) == 0x0002B8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_11) == 0x0002C0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_12) == 0x0002C8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_7) == 0x0002D0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_8) == 0x0002D1, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_12) == 0x0002D2, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_13) == 0x0002D3, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_6) == 0x0002D8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_7) == 0x0002E0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_13) == 0x0002E8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_14) == 0x0002F0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_15) == 0x0002F8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_16) == 0x000300, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_9) == 0x000308, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_10) == 0x000309, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_10' has a wrong offset!");
