#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Helper_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Helper_BP.UI_Helper_BP_C.Add Handle Event
// 0x0030 (0x0030 - 0x0000)
struct UI_Helper_BP_C_Add_Handle_Event final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   InBoneName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GrabLocation;                                      // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Target_0;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Helper_BP_C_Add_Handle_Event) == 0x000008, "Wrong alignment on UI_Helper_BP_C_Add_Handle_Event");
static_assert(sizeof(UI_Helper_BP_C_Add_Handle_Event) == 0x000030, "Wrong size on UI_Helper_BP_C_Add_Handle_Event");
static_assert(offsetof(UI_Helper_BP_C_Add_Handle_Event, Component) == 0x000000, "Member 'UI_Helper_BP_C_Add_Handle_Event::Component' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_Add_Handle_Event, InBoneName) == 0x000008, "Member 'UI_Helper_BP_C_Add_Handle_Event::InBoneName' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_Add_Handle_Event, GrabLocation) == 0x000010, "Member 'UI_Helper_BP_C_Add_Handle_Event::GrabLocation' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_Add_Handle_Event, Target_0) == 0x000028, "Member 'UI_Helper_BP_C_Add_Handle_Event::Target_0' has a wrong offset!");

// Function UI_Helper_BP.UI_Helper_BP_C.ExecuteUbergraph_UI_Helper_BP
// 0x0320 (0x0320 - 0x0000)
struct UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_Component;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InBoneName;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_GrabLocation;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_Target;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0040(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x01A0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsHandleComponent*                CallFunc_AddComponent_ReturnValue;                 // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0218(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_SetLinearDamping_NewLinearDamping_ImplicitCast; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLinearStiffness_NewLinearStiffness_ImplicitCast; // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAngularDamping_NewAngularDamping_ImplicitCast; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAngularStiffness_NewAngularStiffness_ImplicitCast; // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP) == 0x000010, "Wrong alignment on UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP");
static_assert(sizeof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP) == 0x000320, "Wrong size on UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, EntryPoint) == 0x000000, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, K2Node_CustomEvent_Component) == 0x000008, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::K2Node_CustomEvent_Component' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, K2Node_CustomEvent_InBoneName) == 0x000010, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::K2Node_CustomEvent_InBoneName' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, K2Node_CustomEvent_GrabLocation) == 0x000018, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::K2Node_CustomEvent_GrabLocation' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, K2Node_CustomEvent_Target) == 0x000030, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000039, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000040, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000138, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000150, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_Vector_Distance_ReturnValue) == 0x000168, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000170, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000188, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x000190, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, Temp_struct_Variable) == 0x0001A0, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_IsValid_ReturnValue_1) == 0x000200, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_AddComponent_ReturnValue) == 0x000208, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000210, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000218, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_SetLinearDamping_NewLinearDamping_ImplicitCast) == 0x000310, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_SetLinearDamping_NewLinearDamping_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_SetLinearStiffness_NewLinearStiffness_ImplicitCast) == 0x000314, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_SetLinearStiffness_NewLinearStiffness_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_SetAngularDamping_NewAngularDamping_ImplicitCast) == 0x000318, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_SetAngularDamping_NewAngularDamping_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP, CallFunc_SetAngularStiffness_NewAngularStiffness_ImplicitCast) == 0x00031C, "Member 'UI_Helper_BP_C_ExecuteUbergraph_UI_Helper_BP::CallFunc_SetAngularStiffness_NewAngularStiffness_ImplicitCast' has a wrong offset!");

// Function UI_Helper_BP.UI_Helper_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct UI_Helper_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Helper_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on UI_Helper_BP_C_ReceiveTick");
static_assert(sizeof(UI_Helper_BP_C_ReceiveTick) == 0x000004, "Wrong size on UI_Helper_BP_C_ReceiveTick");
static_assert(offsetof(UI_Helper_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'UI_Helper_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

