#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Rank_Unlocked

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_PlayCards_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Rank_Unlocked.UI_Rank_Unlocked_C
// 0x0088 (0x0368 - 0x02E0)
class UUI_Rank_Unlocked_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeToBlack;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       WinAnim_0;                                         // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Hold_Meter;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWillie_BP_C*                           My_Master__Willie_;                                // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<Enum_PlayCards>                        Cards_Array;                                       // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_HalfSwordGameMode_C*                As_BP_Half_Sword_Game_Mode;                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Player_Rank;                                       // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_PlayCards                                Card_1_Type;                                       // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Destroyed;                                         // 0x034D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Settings_C*                         As_GI_Settings;                                    // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Add_Points;                                        // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_PlayerProgression_C*                As_SG_Gauntlet_Player_Progress;                    // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_Rank_Unlocked(int32 EntryPoint);
	struct FSlateBrush GetBrush();
	float GetPercent();
	class FText GetText();
	class FText GetText_0();
	class FText GetText_1();
	ESlateVisibility GetVisibility_0();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Rank_Unlocked_C">();
	}
	static class UUI_Rank_Unlocked_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Rank_Unlocked_C>();
	}
};
static_assert(alignof(UUI_Rank_Unlocked_C) == 0x000008, "Wrong alignment on UUI_Rank_Unlocked_C");
static_assert(sizeof(UUI_Rank_Unlocked_C) == 0x000368, "Wrong size on UUI_Rank_Unlocked_C");
static_assert(offsetof(UUI_Rank_Unlocked_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_Rank_Unlocked_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, FadeIn) == 0x0002E8, "Member 'UUI_Rank_Unlocked_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, FadeToBlack) == 0x0002F0, "Member 'UUI_Rank_Unlocked_C::FadeToBlack' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, Image) == 0x0002F8, "Member 'UUI_Rank_Unlocked_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, Image_0) == 0x000300, "Member 'UUI_Rank_Unlocked_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, Image_2) == 0x000308, "Member 'UUI_Rank_Unlocked_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, TextBlock) == 0x000310, "Member 'UUI_Rank_Unlocked_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, WinAnim_0) == 0x000318, "Member 'UUI_Rank_Unlocked_C::WinAnim_0' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, Hold_Meter) == 0x000320, "Member 'UUI_Rank_Unlocked_C::Hold_Meter' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, My_Master__Willie_) == 0x000328, "Member 'UUI_Rank_Unlocked_C::My_Master__Willie_' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, Cards_Array) == 0x000330, "Member 'UUI_Rank_Unlocked_C::Cards_Array' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, As_BP_Half_Sword_Game_Mode) == 0x000340, "Member 'UUI_Rank_Unlocked_C::As_BP_Half_Sword_Game_Mode' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, Player_Rank) == 0x000348, "Member 'UUI_Rank_Unlocked_C::Player_Rank' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, Card_1_Type) == 0x00034C, "Member 'UUI_Rank_Unlocked_C::Card_1_Type' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, Destroyed) == 0x00034D, "Member 'UUI_Rank_Unlocked_C::Destroyed' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, As_GI_Settings) == 0x000350, "Member 'UUI_Rank_Unlocked_C::As_GI_Settings' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, Add_Points) == 0x000358, "Member 'UUI_Rank_Unlocked_C::Add_Points' has a wrong offset!");
static_assert(offsetof(UUI_Rank_Unlocked_C, As_SG_Gauntlet_Player_Progress) == 0x000360, "Member 'UUI_Rank_Unlocked_C::As_SG_Gauntlet_Player_Progress' has a wrong offset!");

}

