#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Willie_BP_DressUp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Willie_BP_DressUp.Willie_BP_DressUp_C.ExecuteUbergraph_Willie_BP_DressUp
// 0x0138 (0x0138 - 0x0000)
struct Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0040(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp) == 0x000008, "Wrong alignment on Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp");
static_assert(sizeof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp) == 0x000138, "Wrong size on Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp");
static_assert(offsetof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp, EntryPoint) == 0x000000, "Member 'Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000008, "Member 'Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000040, "Member 'Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function Willie_BP_DressUp.Willie_BP_DressUp_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Willie_BP_DressUp_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Willie_BP_DressUp_C_ReceiveTick) == 0x000004, "Wrong alignment on Willie_BP_DressUp_C_ReceiveTick");
static_assert(sizeof(Willie_BP_DressUp_C_ReceiveTick) == 0x000004, "Wrong size on Willie_BP_DressUp_C_ReceiveTick");
static_assert(offsetof(Willie_BP_DressUp_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Willie_BP_DressUp_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

